
# Создать базу данных mysaper.db

# Создать в ней таблицу users с полями name - строка, sex - число: 1-мужской,2-женский, old - число, score - число.

# Добавить в таблицу  c помощью шаблона и цикла for  следующие данные:
# users = [('Алексей', 1, 22, 1000),
#          ('Миша', 1, 19, 800),
#          ('Федор', 1, 26, 1100),
#          ('Маша', 2, 18, 1500)]
#  2 способ: добавить те же данные в таблицу  c помощью шаблона и метода executemany(перезапись данных)
#  3 способ: добавить те же данные в таблицу  c помощью скрипта executescript (перезапись данных)

# Установить ограничители для полей таблицы:
# name - что бы никогда не было пустым
# sex - что бы никогда не было пустым и по умолчанию ставилось значение 1

# Добавить в таблицу поле с автоматически добавляемыми уникальными значениями user_id и главным ключом

# Вывести все поля из таблицы sql запросом
# Вывести скрытое поле rowid всех полей из таблицы.
# Удалить таблицу sql запросом
# Вернуть таблицу



