# Обновить таблицу из прошлого урока добавив в неё поле rowid :
# [('Михаил', 1, 19, 1000),
# ('Федор', 1, 32, 200),
# ('Nicolay', 1, 22, 500),
# ('Мария', 2, 18, 400),
# ('Сергей', 1, 33, 2000),
# ('Владимир', 1, 43, 100),
# ('Елена', 2, 17, 500),
# ('Юля', 2, 23, 700)]
#
# обновить всё поле score на значения 0.
#
# теперь обновить только значение первой ячейки поля score на 1000.
#
# всем игрокам женского пола (2) к текущему значению очков добавить +500.
#
# Обновить игроку с именем Федор значение очков на 1500.(использовать синтаксис обращения к значению ячейки name -
# Федор)
#
# Добавить игрокам с именем, начинающемся на 'М' по 100 очков (используя шаблон обращения к именам) Убедиться что у
# Марии и Михаила изменились значения.
#
# Присвоить игроку с Именем Сергей 700 очков используя оба шаблона (_ и %)
#
# Игрокам у которых возраст больше 40 присвоить 800 очков и изменить возраст на значение 45.
#
# Удалить записи у которых rowid = 2 и 5.
#
# Вставить в таблицу запись ('Даша', 2, 24, 1200) и посмотреть какое у неё будет rowid.
#
#
#
#
