# GROUP BY; count, min, max, avg, sum; DISTINCT, ORDER BY, DESC
#
# Создать таблицу games со следующими данными:
# games = [(1, 200, 100000),
#          (1, 300, 110010),
#          (2, 500, 100010),
#          (1, 400, 201034),
#          (3, 100, 200010),
#          (2, 600, 210000),
#          (2, 300, 210010)]
#
# С помощью агрегирующей функции вывести число записей (игр) сыгранных первым игроком консоли sql.
#
# Сделать то же самое и задать alias в этом запросе, чтоб колонка в выводе запроса была переименована.
#
# Вывести количество уникальных игроков.
#
# Вывести суммарное количество очков выигранное первым игроком за все игры.
#
# Вывести суммарное количество выигранных очков (используя alias - sum) для каждого игрока в отдельности с помощью
# группирующей функции.
#
# Вывести эти данные отсортированные по полю sum в порядке убывания.
#
# Вывести из выше выведенного списка только те, где счёт больше 300.
#
# В конце вывести всего одну из записей вышеописанной выборки.
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#
#